In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

In [2]:
users = pd.read_csv('takehome_users.csv',encoding='latin-1')
eng = pd.read_csv('takehome_user_engagement.csv', encoding='latin-1')

# Wrangling

## Load Data

In [3]:
users

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0
...,...,...,...,...,...,...,...,...,...,...
11995,11996,2013-09-06 06:14:15,Meier Sophia,SophiaMeier@gustr.com,ORG_INVITE,1.378448e+09,0,0,89,8263.0
11996,11997,2013-01-10 18:28:37,Fisher Amelie,AmelieFisher@gmail.com,SIGNUP_GOOGLE_AUTH,1.358275e+09,0,0,200,NaN
11997,11998,2014-04-27 12:45:16,Haynes Jake,JakeHaynes@cuvox.de,GUEST_INVITE,1.398603e+09,1,1,83,8074.0
11998,11999,2012-05-31 11:55:59,Faber Annett,mhaerzxp@iuxiw.com,PERSONAL_PROJECTS,1.338638e+09,0,0,6,NaN
11999,12000,2014-01-26 08:57:12,Lima Thaís,ThaisMeloLima@hotmail.com,SIGNUP,1.390727e+09,0,1,0,NaN

In [4]:
eng

                 time_stamp  user_id  visited
0       2014-04-22 03:53:30        1        1
1       2013-11-15 03:45:04        2        1
2       2013-11-29 03:45:04        2        1
3       2013-12-09 03:45:04        2        1
4       2013-12-25 03:45:04        2        1
...                     ...      ...      ...
207912  2013-09-06 06:14:15    11996        1
207913  2013-01-15 18:28:37    11997        1
207914  2014-04-27 12:45:16    11998        1
207915  2012-06-02 11:55:59    11999        1
207916  2014-01-26 08:57:12    12000        1

[207917 rows x 3 columns]

## Wrangle eng

In [5]:
eng.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207917 entries, 0 to 207916
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time_stamp  207917 non-null  object
 1   user_id     207917 non-null  int64
 2   visited     207917 non-null  int64
dtypes: int64(2), object(1)
memory usage: 4.8+ MB

In [6]:
eng.time_stamp = pd.to_datetime(eng.time_stamp)

In [7]:
eng.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 207917 entries, 0 to 207916
Data columns (total 3 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   time_stamp  207917 non-null  datetime64[ns]
 1   user_id     207917 non-null  int64
 2   visited     207917 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 4.8 MB

In [8]:
eng['day'] = eng.time_stamp.apply(lambda x: x.day)
eng['week'] = eng.time_stamp.apply(lambda x: x.week)

In [9]:
eng

                time_stamp  user_id  visited  day  week
0      2014-04-22 03:53:30        1        1   22    17
1      2013-11-15 03:45:04        2        1   15    46
2      2013-11-29 03:45:04        2        1   29    48
3      2013-12-09 03:45:04        2        1    9    50
4      2013-12-25 03:45:04        2        1   25    52
...                    ...      ...      ...  ...   ...
207912 2013-09-06 06:14:15    11996        1    6    36
207913 2013-01-15 18:28:37    11997        1   15     3
207914 2014-04-27 12:45:16    11998        1   27    17
207915 2012-06-02 11:55:59    11999        1    2    22
207916 2014-01-26 08:57:12    12000        1   26     4

[207917 rows x 5 columns]

In [10]:
eng.drop(columns='time_stamp', inplace=True)

In [11]:
# Only interested if they login >= 3 times on separate days in a week, not over a single day. 
# Dropping duplicate rows representing multiple logins of the same user on a single day
eng.drop_duplicates()

        user_id  visited  day  week
0             1        1   22    17
1             2        1   15    46
2             2        1   29    48
3             2        1    9    50
4             2        1   25    52
...         ...      ...  ...   ...
207912    11996        1    6    36
207913    11997        1   15     3
207914    11998        1   27    17
207915    11999        1    2    22
207916    12000        1   26     4

[187424 rows x 4 columns]

In [12]:
eng = eng.groupby(['user_id', 'week']).sum()

In [13]:
eng

              visited  day
user_id week
1       17          1   22
2       1           1   31
        2           1    8
        6           3   20
        7           2   29
...               ...  ...
11996   36          1    6
11997   3           1   15
11998   17          1   27
11999   22          1    2
12000   4           1   26

[57172 rows x 2 columns]

In [14]:
eng.drop(columns='day', inplace=True)

In [15]:
eng

              visited
user_id week
1       17          1
2       1           1
        2           1
        6           3
        7           2
...               ...
11996   36          1
11997   3           1
11998   17          1
11999   22          1
12000   4           1

[57172 rows x 1 columns]

In [16]:
eng = eng.reset_index()

In [17]:
eng.drop(columns='week', inplace=True)

In [18]:
eng = eng.groupby(['user_id']).max()

In [19]:
eng

         visited
user_id
1              1
2              3
3              1
4              1
5              1
...          ...
11996          1
11997          1
11998          1
11999          1
12000          1

[8823 rows x 1 columns]

In [20]:
eng = eng.reset_index()

In [21]:
eng['adoption'] = eng['visited'].apply(lambda x: True if x >= 3 else False)

In [22]:
eng

      user_id  visited  adoption
0           1        1     False
1           2        3      True
2           3        1     False
3           4        1     False
4           5        1     False
...       ...      ...       ...
8818    11996        1     False
8819    11997        1     False
8820    11998        1     False
8821    11999        1     False
8822    12000        1     False

[8823 rows x 3 columns]

In [23]:
eng.drop(columns='visited', inplace=True)

In [24]:
eng

      user_id  adoption
0           1     False
1           2      True
2           3     False
3           4     False
4           5     False
...       ...       ...
8818    11996     False
8819    11997     False
8820    11998     False
8821    11999     False
8822    12000     False

[8823 rows x 2 columns]

## Join Tables

In [26]:
users.head()

,object_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

In [28]:
users.rename(columns={'object_id':'user_id'}, inplace=True)

In [29]:
users.head()

,user_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0

In [35]:
df = users.merge(eng, 
            how='left',
            on='user_id')

In [36]:
df.head()

,user_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id,adoption
0,1,2014-04-22 03:53:30,Clausen August,AugustCClausen@yahoo.com,GUEST_INVITE,1.398139e+09,1,0,11,10803.0,False
1,2,2013-11-15 03:45:04,Poole Matthew,MatthewPoole@gustr.com,ORG_INVITE,1.396238e+09,0,0,1,316.0,True
2,3,2013-03-19 23:14:52,Bottrill Mitchell,MitchellBottrill@gustr.com,ORG_INVITE,1.363735e+09,0,0,94,1525.0,False
3,4,2013-05-21 08:09:28,Clausen Nicklas,NicklasSClausen@yahoo.com,GUEST_INVITE,1.369210e+09,0,0,1,5151.0,False
4,5,2013-01-17 10:14:20,Raw Grace,GraceRaw@yahoo.com,GUEST_INVITE,1.358850e+09,0,0,193,5240.0,False

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12000 entries, 0 to 11999
Data columns (total 11 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   user_id                     12000 non-null  int64
 1   creation_time               12000 non-null  object
 2   name                        12000 non-null  object
 3   email                       12000 non-null  object
 4   creation_source             12000 non-null  object
 5   last_session_creation_time  8823 non-null   float64
 6   opted_in_to_mailing_list    12000 non-null  int64
 7   enabled_for_marketing_drip  12000 non-null  int64
 8   org_id                      12000 non-null  int64
 9   invited_by_user_id          6417 non-null   float64
 10  adoption                    8823 non-null   object
dtypes: float64(2), int64(4), object(5)
memory usage: 1.1+ MB

In [46]:
df.adoption.isnull()

0        False
1        False
2        False
3        False
4        False
         ...
11995    False
11996    False
11997    False
11998    False
11999    False
Name: adoption, Length: 12000, dtype: bool

Null values in adoption column indicate no timestamp data were available for that user. Take a look and see how new these users are and see if they should be considered False for adoption or removed entirely from the data set as missing values.

In [49]:
df.loc[df.loc[:, 'adoption'].isnull() == True]

,user_id,creation_time,name,email,creation_source,last_session_creation_time,opted_in_to_mailing_list,enabled_for_marketing_drip,org_id,invited_by_user_id,adoption
7,8,2013-07-31 05:34:02,Hamilton Danielle,DanielleHamilton@yahoo.com,PERSONAL_PROJECTS,NaN,1,1,74,NaN,NaN
8,9,2013-11-05 04:04:24,Amsel Paul,PaulAmsel@hotmail.com,PERSONAL_PROJECTS,NaN,0,0,302,NaN,NaN
11,12,2014-04-17 23:48:38,Mathiesen Lærke,LaerkeLMathiesen@cuvox.de,ORG_INVITE,NaN,0,0,130,9270.0,NaN
14,15,2013-07-16 21:33:54,Theiss Ralf,RalfTheiss@hotmail.com,PERSONAL_PROJECTS,NaN,0,0,175,NaN,NaN
15,16,2013-02-11 10:09:50,Engel René,ReneEngel@hotmail.com,PERSONAL_PROJECTS,NaN,0,0,211,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...
11975,11976,2013-12-25 22:01:41,Kohl Leah,LeahKohl@hotmail.com,PERSONAL_PROJECTS,NaN,0,0,248,NaN,NaN
11977,11978,2014-04-23 16:28:06,Castro Pedro,PedroCunhaCastro@gustr.com,PERSONAL_PROJECTS,NaN,1,0,29,NaN,NaN
11984,11985,2013-07-08 17:23:26,Jespersen Marcus,MarcusTJespersen@cuvox.de,PERSONAL_PROJECTS,NaN,0,0,74,NaN,NaN
11992,11993,2013-03-28 23:24:21,Townsend Isabel,IsabelTownsend@cuvox.de,PERSONAL_PROJECTS,NaN,0,0,281,NaN,NaN
11993,11994,2012-06-05 04:46:16,Grimstone Joel,conxzghp@eaouk.com,GUEST_INVITE,NaN,0,0,84,5450.0,NaN

It seems like these Null values should actually be considered False adoption. Looks like they created the account but never logged in. Will inspect further. Look and see what the date range for the eng table is in comparison to this table. Might not make sense to treat adoption of someone who signed up 2 years ago the same as someone who signed up a week ago.